let A=abc**$NBR1
let B=543**$NBR2
let C=$A+$B

let a=abc*10**$NBR1
let b=543*10**$NBR2
let c=$a+$b

let d=AJMR

#echo $d**$C
#echo $d**$c

#echo AJMR**$C
echo JARAM

#let NBR1=abc*10**bcbcb
#let NBR2=543*10**43353
#let $NBR1+$NBR2**AJMR
#echo "JARAM"
# 밑수가 무엇을 의미한느지 모르겠지만 10의 제곱수의 그 밑수?그게 기수인가 밑수인가 인데
# 또 뭐더라 아니면 그냥 제곱 밑의 수를 말하는 그 밑수인지 몰라서
# 둘다해보고 했는데 안되더라고요
# 그래서 제목의 열심히 참여하지 않아서 벌받는 중의 그 벌이 혹시 이런 어려운거인거 끙끙잡아보시게의 벌받는중인지도 의심이 되었습니다
# 그래서 어떻게 하는건가요 너무어렵습니다
# 사실 NBR1=123 이것도 이해가 안됩니다
# 변수 입력받는 거를 검색해봤는데 나오는 거는 read명령어만 봤습니다. 제 정보찾는능력이 부족한건지 아니면 제가 노력을
#덜 해서 그런건진 모르겠지만 그렇게 변수입력받는 것도 뭔지 모르니까 배울 생각을하니 좋네요
# 쉘스크립트 신기해요 변수를 선언할때는 그냥 쓰는데
# 나중에 변수를 받을때는 $를 써서 받는게 신기하더라고요 뭔가 C의포인터와 동질감을 느껴서 어렵겠구나 느꼈습니다.
# 특히 젤 신기했던건 for문인데 for문안의 리스트라 해야하나 그거를 빼내는 거를 ls한걸 grep으로 잡아온걸로 리스트를굳이 선#언 안해줘도 되더라고요 그냥 뭐더라 ${ls | grep}이였나 이걸로 for문이 돌아가더라고요 신기했습니다.
# 그래서 어떻게 하는지 매우 궁금해하며 오늘 밤을 잠들겠습니다.
# 근데 잠을 자는데 발뻗고는 못자겠네요..
# ac 잠자기 전에 제일 원초적인거 그냥 변수만 정의해놓고 그냥 해봤는데 그냥 와 됨 이게 왜됨ㄴ근멈 우와 신기하다
#  사라진 나의 15시간 미쳐미쳐
